package lessons.lesson27_2_устройство_коллекций;

public class Main {
    //1. HashSet устроен на базе HashMap, который (HashMap) в свою очередь построен по принципу хэш таблицы,
    // следовательно и HashSet и HashMap реализуют структуру данных хэш таблица

    //2. TreeSet устроен на базе TreeMap, который (TreeMap) в свою очередь построен по принципу красно-черного бинарного дерева,
    // следовательно и HashSet и HashMap реализуют структуру данных хэш таблица


    //3. LinkedHashSet устроен на базе LinkedHashMap, принцип работы которого совпадает с HshMap просто появляется опция сохранять
    // порядок добавления элементов через LinkedList




}
