package lessons.lesson5_tic_tac_toe;

public class Main {
    public static void main(String[] args) {
//        Создать каркас игры крестии-нолики с тремя режимами:
//
//        Человек vs Человек
//        Человек vs Компьютер
//        Компьютер vs Компьютер
//        В игре должны быт реализованы проверки:
//        - проверка на занятую ячейку
//        - проверка на ввод правильных координат (которые не выходят за пределы игрового поля)
//        - проверка на победителя и ничью
//
//
//        Домашка
//
//       - Доделать необходимые проверки.
//       Добавить режим ComputerKiller, который может сходить,
//       а может и отменить один из ходов соперника (очистить ячейку). Оба действия имеют вероятность 50%, но выполняется только одно.


        new Game().startGame();
    }
}


